nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/demo_apps/bubble_peripheral/pin_mux.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: MC56F81768
package_id: MC56F81768LVLH
mcu_data: ksdk2_0
processor_version: 0.14.12
board: MC56F81000-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL}
  - {pin_num: '37', peripheral: QSCI1, signal: TXD, pin_signal: GPIOC11/LP_SCLS0/LP_SCL1/TXD1/PWMA_0X}
  - {pin_num: '38', peripheral: QSCI1, signal: RXD, pin_signal: GPIOC12/LP_SDAS0/LP_SDA1/RXD1/PWMA_1X}
  - {pin_num: '39', peripheral: GPIOF, signal: 'GPIO, 2', pin_signal: GPIOF2/LP_SCL1/XB_OUT6/LP_SDA0, direction: OUTPUT, gpio_init_state: 'true', open_drain: enable,
    pull_enable: enable}
  - {pin_num: '40', peripheral: GPIOF, signal: 'GPIO, 3', pin_signal: GPIOF3/LP_SDA1/XB_OUT7/LP_SCL0, direction: INPUT, open_drain: enable, pull_enable: enable}
  - {pin_num: '58', peripheral: GPIOF, signal: 'GPIO, 6', pin_signal: GPIOF6/PWMA_3X/LP_SCLS1/XB_IN2, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMode(BOARD_TXD1_GPIO, BOARD_TXD1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C11_TXD1);
    /* Enable peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMode(BOARD_RXD1_GPIO, BOARD_RXD1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C12_RXD1);
    /* GPIO functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SCL1_GPIO, BOARD_LP_SCL1_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SDA1_GPIO, BOARD_LP_SDA1_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMode(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOF3 (pin 40)  */
    GPIO_PinSetDirection(BOARD_LP_SDA1_GPIO, BOARD_LP_SDA1_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOF2 (pin 39) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SCL1_GPIO, BOARD_LP_SCL1_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF3 (pin 40) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SDA1_GPIO, BOARD_LP_SDA1_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Initialize GPIO functionality on pin GPIOF2 (pin 39)  */
    GPIO_PinWrite(BOARD_LP_SCL1_GPIO, BOARD_LP_SCL1_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LP_SCL1_GPIO, BOARD_LP_SCL1_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 58)  */
    GPIO_PinWrite(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_DigitalOutput);

    /* Internal Peripheral Select */
    /* Select SCI1_RXD Input.: Select SCI1_RXD Input, GPIOC12 or GPIOF5. */
    SIM_SetInternalPeriInput(SIM, kSIM_SCI1_RXDInputIndex, kSIM_SCI1_RXDInput_GPIOC12_GPIOF5);


    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_2_MASK | GPIO_PUR_PU_3_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_2_ENABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_3_ENABLED));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
Accel_InitPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: LPI2C1, signal: SCL, pin_signal: GPIOF2/LP_SCL1/XB_OUT6/LP_SDA0, open_drain: enable, pull_enable: enable}
  - {pin_num: '40', peripheral: LPI2C1, signal: SDA, pin_signal: GPIOF3/LP_SDA1/XB_OUT7/LP_SCL0, open_drain: enable, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : Accel_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void Accel_InitPins(void)
{
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMode(ACCEL_INITPINS_LP_SCL1_GPIO, ACCEL_INITPINS_LP_SCL1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F2_LP_SCL1);
    /* Enable peripheral functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMode(ACCEL_INITPINS_LP_SDA1_GPIO, ACCEL_INITPINS_LP_SDA1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F3_LP_SDA1);

    /* Pin configuration on GPIOF2 (pin 39) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(ACCEL_INITPINS_LP_SCL1_GPIO, ACCEL_INITPINS_LP_SCL1_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF3 (pin 40) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(ACCEL_INITPINS_LP_SDA1_GPIO, ACCEL_INITPINS_LP_SDA1_PIN_MASK, kGPIO_OutputOpenDrain);

    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_2_MASK | GPIO_PUR_PU_3_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_2_ENABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_3_ENABLED));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
